#include<stdio.h>
int main()
{
	int n=6,total=0,i,p,k;
	//всички подаръци със стойностите си
    int* gifts=(int*)malloc(sizeof(int)*n);
    gifts[0]=3;
    gifts[1]=7;
    gifts[2]=5;
    gifts[3]=0;
    gifts[4]=7;
    gifts[5]=6;
    //намираме общата сума на всички подаръци
    for(i=0;i<n;i++)
    {
    	total+=gifts[i];
	}
	printf("All gifts price: %d\n",total);
	
	//помощния масив
	int* can=(int*)malloc(sizeof(int)*total+1);
	can[0]=1;//помощна 1ца
   
   //зануляваме останалите елементи в помощния масив
   	for (i=1;i<total+1;i++)
   	{
      can[i]=0;
  	}
  	
  	// Намиране на всички възможни суми за множества от подаръци
  	for ( p=0;p<n;p++)//обхождаме масива с подаръците
   {
	  for( i=total;i>=0;i--)//обхождаме помощния масив отдясно наляво
       {
	    	if (can[i]==1)
        	{
			 can[i+gifts[p]]=1;
        	}
       }
    }
    //Определяне на общите суми от подаръци, които ще получи всеки от братята

   i=total/2;// тъй като помощния масива е симетричен
   while (i>1&&can[i]!=1)//ако на стойността на елемента в помощния масив не е 1ца, 
                        //започваме да го обхождаме наляво докато намаерим съвпадение и докато 
                        //"i" не е станало по- малко от 1
   {
   		i--;
   }
 
   printf("\n%d - %d", i, total-i);
   return 0;
}
